<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Control Center</string>
    <key>Identifier</key>
    <string>com.github.gmarnin.download.logitechcontrolcenter</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
			<string>Logitech Control Center</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>Process</key>
        <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://support.logitech.com/en_us/software/logitech-control-center-for-macintosh-os-x</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://www.logitech.com/pub/techsupport/mouse/mac.*?\.zip)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        	   <key>url</key>
        	   <string>%url%</string>
        	   <key>filename</key>
        	   <string>%NAME%.zip</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/LCC</string>
            </dict>
        </dict>
        <dict>
	<key>Processor</key>
	<string>EndOfCheckPhase</string>
        </dict>
        </array>
</dict>
</plist>
