<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Remotix and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gmarnin.munki.Remotix</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Remotix</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Nulana</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://downloads.nulana.com/remotix/appcast.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
			<string>Remote Access</string>
			<key>developer</key>
			<string>Nulana</string>
            <key>description</key>
            <string>Fast, secure and feature-packed VNC client used for remote access.
		&lt;/p&gt;&lt;/p&gt;
		For more information visit the &lt;a href="http://downloads.nulana.com/remotix/Remotix-4.1-18987-ReleaseNotes.html" target="_blank"&gt;Release Notes&lt;/a&gt;.&lt;/p&gt;&lt;/html&gt;</string>
            <key>display_name</key>
            <string>Remotix</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
	<string>com.github.gmarnin.download.Remotix</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>